; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=183, out_folder=./training, instance_id=21, seed=2045, goal_proportion=0.03

(define (problem blocksworld-21)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 b78 b79 b80 b81 b82 b83 b84 b85 b86 b87 b88 b89 b90 b91 b92 b93 b94 b95 b96 b97 b98 b99 b100 b101 b102 b103 b104 b105 b106 b107 b108 b109 b110 b111 b112 b113 b114 b115 b116 b117 b118 b119 b120 b121 b122 b123 b124 b125 b126 b127 b128 b129 b130 b131 b132 b133 b134 b135 b136 b137 b138 b139 b140 b141 b142 b143 b144 b145 b146 b147 b148 b149 b150 b151 b152 b153 b154 b155 b156 b157 b158 b159 b160 b161 b162 b163 b164 b165 b166 b167 b168 b169 b170 b171 b172 b173 b174 b175 b176 b177 b178 b179 b180 b181 b182 b183 - object)
 (:init 
    (arm-empty)
    (clear b106)
    (on-table b106)
    (clear b7)
    (on b7 b135)
    (on b135 b93)
    (on b93 b165)
    (on b165 b88)
    (on-table b88)
    (clear b131)
    (on b131 b46)
    (on-table b46)
    (clear b155)
    (on b155 b28)
    (on-table b28)
    (clear b22)
    (on b22 b152)
    (on b152 b143)
    (on b143 b60)
    (on b60 b5)
    (on b5 b71)
    (on-table b71)
    (clear b114)
    (on b114 b3)
    (on b3 b159)
    (on b159 b144)
    (on b144 b70)
    (on-table b70)
    (clear b55)
    (on b55 b137)
    (on b137 b64)
    (on-table b64)
    (clear b125)
    (on b125 b113)
    (on b113 b179)
    (on b179 b177)
    (on b177 b157)
    (on-table b157)
    (clear b181)
    (on b181 b149)
    (on b149 b153)
    (on b153 b36)
    (on-table b36)
    (clear b154)
    (on b154 b21)
    (on b21 b107)
    (on b107 b138)
    (on b138 b11)
    (on b11 b47)
    (on-table b47)
    (clear b2)
    (on b2 b86)
    (on b86 b121)
    (on b121 b91)
    (on b91 b101)
    (on b101 b183)
    (on b183 b37)
    (on b37 b72)
    (on b72 b90)
    (on b90 b32)
    (on b32 b147)
    (on b147 b124)
    (on-table b124)
    (clear b18)
    (on b18 b80)
    (on b80 b170)
    (on b170 b14)
    (on b14 b95)
    (on b95 b99)
    (on b99 b62)
    (on-table b62)
    (clear b97)
    (on b97 b16)
    (on b16 b4)
    (on b4 b12)
    (on b12 b111)
    (on b111 b161)
    (on-table b161)
    (clear b117)
    (on b117 b89)
    (on b89 b44)
    (on b44 b120)
    (on b120 b172)
    (on b172 b50)
    (on b50 b63)
    (on b63 b77)
    (on b77 b87)
    (on b87 b118)
    (on b118 b83)
    (on b83 b26)
    (on-table b26)
    (clear b176)
    (on b176 b160)
    (on b160 b173)
    (on b173 b23)
    (on-table b23)
    (clear b148)
    (on b148 b54)
    (on b54 b48)
    (on-table b48)
    (clear b82)
    (on b82 b129)
    (on-table b129)
    (clear b84)
    (on b84 b130)
    (on-table b130)
    (clear b24)
    (on b24 b75)
    (on b75 b141)
    (on b141 b51)
    (on-table b51)
    (clear b169)
    (on b169 b96)
    (on b96 b43)
    (on b43 b45)
    (on b45 b162)
    (on b162 b38)
    (on b38 b73)
    (on-table b73)
    (clear b10)
    (on-table b10)
    (clear b127)
    (on b127 b151)
    (on b151 b175)
    (on b175 b20)
    (on b20 b41)
    (on b41 b100)
    (on b100 b15)
    (on b15 b164)
    (on b164 b6)
    (on-table b6)
    (clear b19)
    (on b19 b182)
    (on-table b182)
    (clear b76)
    (on b76 b39)
    (on b39 b53)
    (on b53 b79)
    (on b79 b115)
    (on b115 b105)
    (on b105 b139)
    (on b139 b1)
    (on b1 b142)
    (on b142 b85)
    (on b85 b27)
    (on-table b27)
    (clear b123)
    (on b123 b29)
    (on b29 b128)
    (on b128 b158)
    (on b158 b136)
    (on b136 b8)
    (on b8 b180)
    (on-table b180)
    (clear b69)
    (on b69 b42)
    (on-table b42)
    (clear b57)
    (on b57 b40)
    (on b40 b110)
    (on b110 b112)
    (on b112 b67)
    (on b67 b35)
    (on-table b35)
    (clear b30)
    (on-table b30)
    (clear b119)
    (on b119 b68)
    (on b68 b174)
    (on b174 b167)
    (on b167 b98)
    (on-table b98)
    (clear b74)
    (on b74 b150)
    (on b150 b116)
    (on-table b116)
    (clear b65)
    (on b65 b66)
    (on b66 b49)
    (on b49 b146)
    (on b146 b56)
    (on b56 b9)
    (on b9 b132)
    (on b132 b58)
    (on b58 b109)
    (on b109 b31)
    (on b31 b94)
    (on b94 b104)
    (on b104 b178)
    (on-table b178)
    (clear b103)
    (on b103 b81)
    (on-table b81)
    (clear b163)
    (on-table b163)
    (clear b134)
    (on b134 b156)
    (on b156 b133)
    (on-table b133)
    (clear b17)
    (on-table b17)
    (clear b140)
    (on b140 b92)
    (on b92 b122)
    (on b122 b52)
    (on b52 b168)
    (on b168 b126)
    (on-table b126)
    (clear b171)
    (on b171 b59)
    (on b59 b34)
    (on-table b34)
    (clear b102)
    (on-table b102)
    (clear b78)
    (on b78 b25)
    (on-table b25)
    (clear b61)
    (on-table b61)
    (clear b166)
    (on b166 b145)
    (on b145 b13)
    (on-table b13)
    (clear b108)
    (on b108 b33)
    (on-table b33))
 (:goal  (and 
    (clear b3)
    (on b3 b5)
    (on b5 b2)
    (on-table b2)
    (clear b1)
    (on-table b1)
    (clear b4)
    (on-table b4))))

; plan
1. (unstack b2 b86)
   deleted: (on b2 b86) (clear b2) (arm-empty)
   added: (holding b2) (clear b86)
   goals met: 0 of 8
2. (putdown b2)
   deleted: (holding b2)
   added: (clear b2) (arm-empty) (on-table b2)
   goals met: 1 of 8
3. (unstack b114 b3)
   deleted: (on b114 b3) (clear b114) (arm-empty)
   added: (holding b114) (clear b3)
   goals met: 2 of 8
4. (putdown b114)
   deleted: (holding b114)
   added: (clear b114) (arm-empty) (on-table b114)
   goals met: 2 of 8
5. (unstack b22 b152)
   deleted: (on b22 b152) (clear b22) (arm-empty)
   added: (holding b22) (clear b152)
   goals met: 2 of 8
6. (putdown b22)
   deleted: (holding b22)
   added: (clear b22) (arm-empty) (on-table b22)
   goals met: 2 of 8
7. (unstack b152 b143)
   deleted: (on b152 b143) (clear b152) (arm-empty)
   added: (holding b152) (clear b143)
   goals met: 2 of 8
8. (putdown b152)
   deleted: (holding b152)
   added: (clear b152) (arm-empty) (on-table b152)
   goals met: 2 of 8
9. (unstack b143 b60)
   deleted: (on b143 b60) (clear b143) (arm-empty)
   added: (holding b143) (clear b60)
   goals met: 2 of 8
10. (putdown b143)
   deleted: (holding b143)
   added: (clear b143) (arm-empty) (on-table b143)
   goals met: 2 of 8
11. (unstack b60 b5)
   deleted: (on b60 b5) (clear b60) (arm-empty)
   added: (holding b60) (clear b5)
   goals met: 2 of 8
12. (putdown b60)
   deleted: (holding b60)
   added: (clear b60) (arm-empty) (on-table b60)
   goals met: 2 of 8
13. (unstack b76 b39)
   deleted: (on b76 b39) (clear b76) (arm-empty)
   added: (holding b76) (clear b39)
   goals met: 2 of 8
14. (putdown b76)
   deleted: (holding b76)
   added: (clear b76) (arm-empty) (on-table b76)
   goals met: 2 of 8
15. (unstack b39 b53)
   deleted: (on b39 b53) (clear b39) (arm-empty)
   added: (holding b39) (clear b53)
   goals met: 2 of 8
16. (putdown b39)
   deleted: (holding b39)
   added: (clear b39) (arm-empty) (on-table b39)
   goals met: 2 of 8
17. (unstack b53 b79)
   deleted: (on b53 b79) (clear b53) (arm-empty)
   added: (holding b53) (clear b79)
   goals met: 2 of 8
18. (putdown b53)
   deleted: (holding b53)
   added: (clear b53) (arm-empty) (on-table b53)
   goals met: 2 of 8
19. (unstack b79 b115)
   deleted: (on b79 b115) (clear b79) (arm-empty)
   added: (holding b79) (clear b115)
   goals met: 2 of 8
20. (putdown b79)
   deleted: (holding b79)
   added: (clear b79) (arm-empty) (on-table b79)
   goals met: 2 of 8
21. (unstack b115 b105)
   deleted: (on b115 b105) (clear b115) (arm-empty)
   added: (holding b115) (clear b105)
   goals met: 2 of 8
22. (putdown b115)
   deleted: (holding b115)
   added: (clear b115) (arm-empty) (on-table b115)
   goals met: 2 of 8
23. (unstack b105 b139)
   deleted: (on b105 b139) (clear b105) (arm-empty)
   added: (holding b105) (clear b139)
   goals met: 2 of 8
24. (putdown b105)
   deleted: (holding b105)
   added: (clear b105) (arm-empty) (on-table b105)
   goals met: 2 of 8
25. (unstack b139 b1)
   deleted: (on b139 b1) (clear b139) (arm-empty)
   added: (holding b139) (clear b1)
   goals met: 3 of 8
26. (putdown b139)
   deleted: (holding b139)
   added: (clear b139) (arm-empty) (on-table b139)
   goals met: 3 of 8
27. (unstack b1 b142)
   deleted: (on b1 b142) (clear b1) (arm-empty)
   added: (holding b1) (clear b142)
   goals met: 2 of 8
28. (putdown b1)
   deleted: (holding b1)
   added: (clear b1) (arm-empty) (on-table b1)
   goals met: 4 of 8
29. (unstack b97 b16)
   deleted: (on b97 b16) (clear b97) (arm-empty)
   added: (holding b97) (clear b16)
   goals met: 4 of 8
30. (putdown b97)
   deleted: (holding b97)
   added: (clear b97) (arm-empty) (on-table b97)
   goals met: 4 of 8
31. (unstack b16 b4)
   deleted: (on b16 b4) (clear b16) (arm-empty)
   added: (holding b16) (clear b4)
   goals met: 5 of 8
32. (putdown b16)
   deleted: (holding b16)
   added: (clear b16) (arm-empty) (on-table b16)
   goals met: 5 of 8
33. (unstack b4 b12)
   deleted: (on b4 b12) (clear b4) (arm-empty)
   added: (holding b4) (clear b12)
   goals met: 4 of 8
34. (putdown b4)
   deleted: (holding b4)
   added: (clear b4) (arm-empty) (on-table b4)
   goals met: 6 of 8
35. (unstack b5 b71)
   deleted: (on b5 b71) (clear b5) (arm-empty)
   added: (holding b5) (clear b71)
   goals met: 6 of 8
36. (stack b5 b2)
   deleted: (clear b2) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b2)
   goals met: 7 of 8
37. (unstack b3 b159)
   deleted: (on b3 b159) (clear b3) (arm-empty)
   added: (holding b3) (clear b159)
   goals met: 6 of 8
38. (stack b3 b5)
   deleted: (clear b5) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b5)
   goals met: 8 of 8
